Tekla Open API Reference for Tekla Structures 2025
UserPropertyItem.GetOptions Method (List<KeyValuePair<Double, String>>, Boolean)
 Gets the value options of a double property.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool GetOptions(
	ref List<KeyValuePair<double, string>> DoubleOptions,
	bool translatedLabels
)
Public Function GetOptions (
	ByRef DoubleOptions As List(Of KeyValuePair(Of Double, String)),
	translatedLabels As Boolean
) As Boolean
Parameters
DoubleOptions
Type: System.Collections.Generic.List<KeyValuePair<Double, String>>
The value options.
translatedLabels
Type: System.Boolean
if set to true labels translated to current language are returned, otherwise the resource key of label is returned.
Return Value
Type: Boolean
True on success.
See Also
Reference
UserPropertyItem Class
GetOptions Overload
Tekla.Structures.Catalogs Namespace